public/performance/payment/fyscal-1/transaction.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group-token-generation" enabled="false">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="token-gen-1">
          <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T11:43:08.093548106</stringProp>
          <stringProp name="HTTPSampler.domain">dev-api.smartmoney.com.ph</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/workflows/public/v1/initiate</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;workflow_name&quot;: &quot;agent_signin&quot;,&#xd;
    &quot;input_params&quot;: {&#xd;
        &quot;email&quot;: &quot;suyash@aventistechnology.com&quot;,&#xd;
        &quot;encrypted_password&quot;: &quot;PUQYnyowaiZyCvEMIcRTgQkriq8Te9uGgEazq9G33anULS2cbkUM6qi+EGjSdD3IlcrPSMHI8+sGmcCoppPJRi4+XRe1L7Q9FQHJbsacBE9pnymExaZ2E949Xw16EbqJFe1qkNKYfpzmSDiqYeAiSRdIU5my8Xhajbup6z78nVvTB4SAk9xmrGZ0TrIBEPMM/FtL6a1AxKAzMFHdS1jDvT3+xXpdaiOeI+j6vTmi24rl+CXLjkJj8+kt/6QqBfGdS31rD4u1VBGnjOA8JaBWEy5jiy+1gA7bQSw8SRIFf2wOZ+kWbIy+r/PPBp8zVtln2sdYw3VFUlHIaGpK56IT8A==&quot;&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP HeaderManager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="x-user-identifier-type" elementType="Header">
                <stringProp name="Header.name">x-user-identifier-type</stringProp>
                <stringProp name="Header.value">email</stringProp>
              </elementProp>
              <elementProp name="x-user-identifier-value" elementType="Header">
                <stringProp name="Header.name">x-user-identifier-value</stringProp>
                <stringProp name="Header.value">suyash@aventistechnology.com</stringProp>
              </elementProp>
              <elementProp name="x-client-id" elementType="Header">
                <stringProp name="Header.name">x-client-id</stringProp>
                <stringProp name="Header.value">smart_app_backoffice</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T11:43:08.096125951</stringProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">workflow_id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.workflow_id</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="token-gen-2">
          <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T11:44:09.127137927</stringProp>
          <stringProp name="HTTPSampler.domain">dev-api.smartmoney.com.ph</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/workflows/public/v1/execute</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;input_params&quot;: {&#xd;
    &quot;encrypted_otp&quot;: &quot;DVhgOzua/e9FoTyYg1SaFsSsmvN+oVVN5Xb62NQZPoc/DU937/0YNee0+XtojI7rncmP9TcbLYIIfvN9J5czdhnAitkfyS4aoSvkXNv4kvJAmADuYGiwI4R51pS4+j0YzvBCB2LCFGQxm9cIj4iff/Zxk1FewRgvFeidZ8PMwid+O0iGuBciyuSdZeiUXVUdAO+EPTFKGdBqfZs1HihyueocfiVSIsyp33G6yVbzbd+3zMcVG1A2WsK/s0bFzqbsLtrZ2ukuAp3JbqduV5J5caRRQld0UdHaVfqixZeM520wZaLgocf1pYOrqITAK8EYe5d6HNoQAP+rDa6/K600JQ==&quot;&#xd;
    },&#xd;
    &quot;workflow_name&quot;: &quot;agent_signin&quot;,&#xd;
    &quot;workflow_id&quot;: &quot;${workflow_id}&quot;,&#xd;
    &quot;step&quot;: &quot;verify_otp_get_token&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP HeaderManager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="x-workflow-id" elementType="Header">
                <stringProp name="Header.name">x-workflow-id</stringProp>
                <stringProp name="Header.value">${workflow_id}</stringProp>
              </elementProp>
              <elementProp name="x-client-id" elementType="Header">
                <stringProp name="Header.name">x-client-id</stringProp>
                <stringProp name="Header.value">smart_app_backoffice</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T11:44:09.127284951</stringProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor">
            <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.result.token</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">props.put(&quot;TOKEN&quot;, vars.get(&quot;token&quot;))</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group-token-generation-fyscal">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="token-gen-1" enabled="true">
          <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T11:43:08.093548106</stringProp>
          <stringProp name="HTTPSampler.domain">stg-api.fyscal.ai</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/workflows/public/v1/initiate</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;workflow_name&quot;:&quot;agent_signin&quot;,&quot;input_params&quot;:{&quot;email&quot;:&quot;suyash@fyscaltech.com&quot;,&quot;encrypted_password&quot;:&quot;MSUz3CHEB+wJpkBf2mLsNEDMOqMPrnGrMUfXPMxWxUsvLh46FWVjhC5mqr+oGrsLL4cv7b2snLZSQcTy9gqh5OiEK8TVYAaCuSl7oQ4Lxuw3rQ7Jjij01mn+1gQvNPLPnnMkl7p4tOZdCFRcCdkYie0nUlfByz5jcAr/0ZsljXm/ip8+8yj7d0iIFWmyvWAcad43WtC5K9v6ubiapk60Jz5veM/Ot6Zwb3J6th6/SOXbYdG/FD8glHBGjFOHfBDARl6T8KSP0AqmPnDay1BZZ6qGrmwJfGAK1Jl3pTNz+IIqbENWYS2uxTBLbnTWSb0p2qGPAhHWx0ktFDcYq+Dzig==&quot;}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP HeaderManager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="x-user-identifier-type" elementType="Header">
                <stringProp name="Header.name">x-user-identifier-type</stringProp>
                <stringProp name="Header.value">email</stringProp>
              </elementProp>
              <elementProp name="x-user-identifier-value" elementType="Header">
                <stringProp name="Header.name">x-user-identifier-value</stringProp>
                <stringProp name="Header.value">suyash@fyscaltech.com</stringProp>
              </elementProp>
              <elementProp name="x-client-id" elementType="Header">
                <stringProp name="Header.name">x-client-id</stringProp>
                <stringProp name="Header.value">smart_app_backoffice</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T11:43:08.096125951</stringProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">workflow_id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.workflow_id</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="token-gen-2" enabled="true">
          <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T11:44:09.127137927</stringProp>
          <stringProp name="HTTPSampler.domain">stg-api.fyscal.ai</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/workflows/public/v1/execute</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;input_params&quot;: {&#xd;
    &quot;encrypted_otp&quot;: &quot;DVhgOzua/e9FoTyYg1SaFsSsmvN+oVVN5Xb62NQZPoc/DU937/0YNee0+XtojI7rncmP9TcbLYIIfvN9J5czdhnAitkfyS4aoSvkXNv4kvJAmADuYGiwI4R51pS4+j0YzvBCB2LCFGQxm9cIj4iff/Zxk1FewRgvFeidZ8PMwid+O0iGuBciyuSdZeiUXVUdAO+EPTFKGdBqfZs1HihyueocfiVSIsyp33G6yVbzbd+3zMcVG1A2WsK/s0bFzqbsLtrZ2ukuAp3JbqduV5J5caRRQld0UdHaVfqixZeM520wZaLgocf1pYOrqITAK8EYe5d6HNoQAP+rDa6/K600JQ==&quot;&#xd;
    },&#xd;
    &quot;workflow_name&quot;: &quot;agent_signin&quot;,&#xd;
    &quot;workflow_id&quot;: &quot;${workflow_id}&quot;,&#xd;
    &quot;step&quot;: &quot;verify_otp_get_token&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP HeaderManager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="x-workflow-id" elementType="Header">
                <stringProp name="Header.name">x-workflow-id</stringProp>
                <stringProp name="Header.value">${workflow_id}</stringProp>
              </elementProp>
              <elementProp name="x-client-id" elementType="Header">
                <stringProp name="Header.name">x-client-id</stringProp>
                <stringProp name="Header.value">smart_app_backoffice</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T11:44:09.127284951</stringProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.result.token</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">props.put(&quot;TOKEN&quot;, vars.get(&quot;token&quot;))</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="transaction">
          <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T16:47:02.365144408</stringProp>
          <stringProp name="HTTPSampler.domain">stg-api.fyscal.ai</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/ledger/v1/formatted/api/ledger_transactions</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;status&quot;: &quot;posted&quot;,&#xd;
    &quot;external_id&quot;: &quot;txn_${__time(YMDHMS)}_${__Random(1000,9999)}&quot;,&#xd;
    &quot;description&quot;: &quot;Sample ledger transaction description&quot;,&#xd;
    &quot;ledger_entries&quot;: [&#xd;
        {&#xd;
            &quot;amount&quot;: 50,&#xd;
            &quot;direction&quot;: &quot;credit&quot;,&#xd;
            &quot;ledger_account_id&quot;: &quot;${credit_id}&quot;&#xd;
        },&#xd;
        {&#xd;
            &quot;amount&quot;: 50,&#xd;
            &quot;direction&quot;: &quot;debit&quot;,&#xd;
            &quot;ledger_account_id&quot;: &quot;${debit_id}&quot;&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP HeaderManager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="x-client-id" elementType="Header">
                <stringProp name="Header.name">x-client-id</stringProp>
                <stringProp name="Header.value">smart_app_backoffice</stringProp>
              </elementProp>
              <elementProp name="x-scope" elementType="Header">
                <stringProp name="Header.name">x-scope</stringProp>
                <stringProp name="Header.value">ledger:ledger_transactions_create</stringProp>
              </elementProp>
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${__P(TOKEN)}</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T16:47:02.366213452</stringProp>
          </HeaderManager>
          <hashTree/>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config-credit">
            <stringProp name="delimiter">,</stringProp>
            <stringProp name="filename">/home/kelly/smart-money-load-testing/ledger-performance/credit_accounts.csv</stringProp>
            <boolProp name="ignoreFirstLine">false</boolProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">false</boolProp>
            <stringProp name="shareMode">shareMode.all</stringProp>
            <boolProp name="stopThread">true</boolProp>
            <stringProp name="variableNames">credit_id</stringProp>
          </CSVDataSet>
          <hashTree/>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config-debit">
            <stringProp name="delimiter">,</stringProp>
            <stringProp name="filename">/home/kelly/smart-money-load-testing/ledger-performance/debit_accounts.csv</stringProp>
            <boolProp name="ignoreFirstLine">false</boolProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">false</boolProp>
            <stringProp name="shareMode">shareMode.all</stringProp>
            <boolProp name="stopThread">true</boolProp>
            <stringProp name="variableNames">debit_id</stringProp>
          </CSVDataSet>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">if (!prev.isSuccessful()) {
	def timestamp = new Date().format(&quot;yyyyMMdd_HHmmss&quot;)
	def file = new File(&quot;/home/kelly/smart-money-load-testing/ledger-performance/debug_${timestamp}.txt&quot;)
    file &lt;&lt; &quot;Request:\n&quot; + prev.getSamplerData() + &quot;\n&quot;
    file &lt;&lt; &quot;Response:\n&quot; + prev.getResponseDataAsString() + &quot;\n\n&quot;
}</stringProp>
        </JSR223PostProcessor>
        <hashTree/>
      </hashTree>
      <kg.apc.jmeter.threads.SteppingThreadGroup guiclass="kg.apc.jmeter.threads.SteppingThreadGroupGui" testclass="kg.apc.jmeter.threads.SteppingThreadGroup" testname="jp@gc - Stepping Thread Group" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="Threads initial delay">5</stringProp>
        <stringProp name="Start users count">5</stringProp>
        <stringProp name="Start users count burst">10</stringProp>
        <stringProp name="Start users period">30</stringProp>
        <stringProp name="Stop users count">10</stringProp>
        <stringProp name="Stop users period">5</stringProp>
        <stringProp name="flighttime">60</stringProp>
        <stringProp name="rampUp">10</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </kg.apc.jmeter.threads.SteppingThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="transaction">
          <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T16:47:02.365144408</stringProp>
          <stringProp name="HTTPSampler.domain">dev-api.smartmoney.com.ph</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/ledger/v1/formatted/api/ledger_transactions</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;status&quot;: &quot;posted&quot;,&#xd;
    &quot;external_id&quot;: &quot;txn_${__time(YMDHMS)}_${__Random(1000,9999)}&quot;,&#xd;
    &quot;description&quot;: &quot;Sample ledger transaction description&quot;,&#xd;
    &quot;ledger_entries&quot;: [&#xd;
        {&#xd;
            &quot;amount&quot;: 50,&#xd;
            &quot;direction&quot;: &quot;credit&quot;,&#xd;
            &quot;ledger_account_id&quot;: &quot;${credit_id}&quot;&#xd;
        },&#xd;
        {&#xd;
            &quot;amount&quot;: 50,&#xd;
            &quot;direction&quot;: &quot;debit&quot;,&#xd;
            &quot;ledger_account_id&quot;: &quot;${debit_id}&quot;&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP HeaderManager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="x-client-id" elementType="Header">
                <stringProp name="Header.name">x-client-id</stringProp>
                <stringProp name="Header.value">smart_app_backoffice</stringProp>
              </elementProp>
              <elementProp name="x-scope" elementType="Header">
                <stringProp name="Header.name">x-scope</stringProp>
                <stringProp name="Header.value">ledger:ledger_transactions_create</stringProp>
              </elementProp>
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${__P(TOKEN)}</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="TestPlan.comments">Created from cURL on 2026-04-10T16:47:02.366213452</stringProp>
          </HeaderManager>
          <hashTree/>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config-credit">
            <stringProp name="delimiter">,</stringProp>
            <stringProp name="filename">/home/kelly/smart-money-load-testing/ledger-performance/credit2.csv</stringProp>
            <boolProp name="ignoreFirstLine">false</boolProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">false</boolProp>
            <stringProp name="shareMode">shareMode.all</stringProp>
            <boolProp name="stopThread">true</boolProp>
            <stringProp name="variableNames">credit_id</stringProp>
          </CSVDataSet>
          <hashTree/>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config-debit">
            <stringProp name="delimiter">,</stringProp>
            <stringProp name="filename">/home/kelly/smart-money-load-testing/ledger-performance/debit2.csv</stringProp>
            <boolProp name="ignoreFirstLine">false</boolProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">false</boolProp>
            <stringProp name="shareMode">shareMode.all</stringProp>
            <boolProp name="stopThread">true</boolProp>
            <stringProp name="variableNames">debit_id</stringProp>
          </CSVDataSet>
          <hashTree/>
        </hashTree>
        <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">if (!prev.isSuccessful()) {
    def file = new File(&quot;/home/kelly/smart-money-load-testing/ledger-performance/debug.txt&quot;)
    file &lt;&lt; &quot;Request:\n&quot; + prev.getSamplerData() + &quot;\n&quot;
    file &lt;&lt; &quot;Response:\n&quot; + prev.getResponseDataAsString() + &quot;\n\n&quot;
}</stringProp>
        </JSR223PostProcessor>
        <hashTree/>
      </hashTree>
      <DNSCacheManager guiclass="DNSCachePanel" testclass="DNSCacheManager" testname="DNS Cache Manager">
        <collectionProp name="DNSCacheManager.servers"/>
        <collectionProp name="DNSCacheManager.hosts"/>
        <boolProp name="DNSCacheManager.clearEachIteration">false</boolProp>
        <boolProp name="DNSCacheManager.isCustomResolver">false</boolProp>
      </DNSCacheManager>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group" enabled="false">
        <collectionProp name="ultimatethreadgroupdata"/>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree/>
      <ResultSaver guiclass="ResultSaverGui" testclass="ResultSaver" testname="Save Responses to a file" enabled="false">
        <boolProp name="FileSaver.errorsonly">false</boolProp>
        <boolProp name="FileSaver.successonly">false</boolProp>
        <boolProp name="FileSaver.skipsuffix">false</boolProp>
        <boolProp name="FileSaver.skipautonumber">false</boolProp>
      </ResultSaver>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>